# Pandas

In [62]:
import pandas as pd

disciplinas =pd.Series(['Matemática','Historia','Economía', 'Programacion'],dtype = 'string')
disciplinas

0      Matemática
1        Historia
2        Economía
3    Programacion
dtype: string

In [63]:
numeros = pd.Series ([1,2,3,4,5,6,7])
print(numeros)
print (numeros.size)
print(numeros.index)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64
7
RangeIndex(start=0, stop=7, step=1)

In [64]:
numeros.count() 
numeros = pd.Series ([1,2,3,4,5,6,7, None])
print(numeros)
print (numeros.size)
print(numeros.index)
numeros.count()

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
6    7.0
7    NaN
dtype: float64
8
RangeIndex(start=0, stop=8, step=1)

7

operadpres

In [65]:
numeros*3

0     3.0
1     6.0
2     9.0
3    12.0
4    15.0
5    18.0
6    21.0
7     NaN
dtype: float64

metodo apply aplicar uuna funcion a todo

In [66]:
numeros.apply(lambda x: x**2+3)

0     4.0
1     7.0
2    12.0
3    19.0
4    28.0
5    39.0
6    52.0
7     NaN
dtype: float64

In [67]:
numeros[numeros>5]

5    6.0
6    7.0
dtype: float64

In [68]:
numeros.sort_values()

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
6    7.0
7    NaN
dtype: float64

In [69]:
numeros.sort_index()

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
6    7.0
7    NaN
dtype: float64

In [70]:
numerosSinNone = numeros.dropna() #devuelve sin los None
print (numeros)
print( numerosSinNone)

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
6    7.0
7    NaN
dtype: float64
0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
6    7.0
dtype: float64

In [71]:
#usando el constructor de la clase dicc

diccionario = dict(juan=[7,6,8], ana=[2,4,7])
diccionario
df = pd.DataFrame(diccionario, index =['parcial 1','parcial 2','parcial 3'])
df

           juan  ana
parcial 1     7    2
parcial 2     6    4
parcial 3     8    7

In [72]:
dr = pd.read_csv(r'C:\Users\Luca\Desktop\VsCode\Data Scientist\CURSADO HENRY DTS09\MOODULO 1\homework 4 pandas\colesterol.csv')
dr

                                           nombre;edad;sexo;peso;altura;colesterol
José Luis Martínez Izquierdo;18;H;85;1                                      79;182
Rosa Díaz Díaz;32;M;65;1                                                    73;232
Javier García Sánchez;24;H;;1                                               81;191
Carmen López Pinzón;35;M;65;1                                               70;200
Marisa López Collado;46;M;51;1                                              58;148
Antonio Ruiz Cruz;68;H;66;1                                                 74;249
Antonio Fernández Ocaña;51;H;62;1                                           72;276
Pilar Martín González;22;M;60;1                                                66;
Pedro Gálvez Tenorio;35;H;90;1                                              94;241
Santiago Reillo Manzano;46;H;75;1                                           85;280
Macarena Álvarez Luna;53;M;55;1                                             62;262
José María de la Guía Sanz;58;H;78;1                                        87;198
Miguel Angel Cuadrado Gutiérrez;27;H;109;1                                  98;210
Carolina Rubio Moreno;20;M;61;1                                             77;194

In [73]:
dr = pd.read_csv(r'C:\Users\Luca\Desktop\VsCode\Data Scientist\CURSADO HENRY DTS09\MOODULO 1\homework 4 pandas\colesterol.csv',sep= ';', decimal= ',' )
dr

                             nombre  edad sexo   peso  altura  colesterol
0      José Luis Martínez Izquierdo    18    H   85.0    1.79       182.0
1                    Rosa Díaz Díaz    32    M   65.0    1.73       232.0
2             Javier García Sánchez    24    H    NaN    1.81       191.0
3               Carmen López Pinzón    35    M   65.0    1.70       200.0
4              Marisa López Collado    46    M   51.0    1.58       148.0
5                 Antonio Ruiz Cruz    68    H   66.0    1.74       249.0
6           Antonio Fernández Ocaña    51    H   62.0    1.72       276.0
7             Pilar Martín González    22    M   60.0    1.66         NaN
8              Pedro Gálvez Tenorio    35    H   90.0    1.94       241.0
9           Santiago Reillo Manzano    46    H   75.0    1.85       280.0
10            Macarena Álvarez Luna    53    M   55.0    1.62       262.0
11       José María de la Guía Sanz    58    H   78.0    1.87       198.0
12  Miguel Angel Cuadrado Gutiérrez    27    H  109.0    1.98       210.0
13            Carolina Rubio Moreno    20    M   61.0    1.77       194.0

In [74]:
dr.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   nombre      14 non-null     object
 1   edad        14 non-null     int64
 2   sexo        14 non-null     object
 3   peso        13 non-null     float64
 4   altura      14 non-null     float64
 5   colesterol  13 non-null     float64
dtypes: float64(3), int64(1), object(2)
memory usage: 800.0+ bytes

In [75]:
dr.size #cuenta todos los valores del dataframe

84

In [76]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, parcial 1 to parcial 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   juan    3 non-null      int64
 1   ana     3 non-null      int64
dtypes: int64(2)
memory usage: 72.0+ bytes

In [77]:
dr.size

84

In [78]:
dr[ (dr['sexo'] == 'H') & (dr['colesterol'] > 210)]

                    nombre  edad sexo  peso  altura  colesterol
5        Antonio Ruiz Cruz    68    H  66.0    1.74       249.0
6  Antonio Fernández Ocaña    51    H  62.0    1.72       276.0
8     Pedro Gálvez Tenorio    35    H  90.0    1.94       241.0
9  Santiago Reillo Manzano    46    H  75.0    1.85       280.0

In [79]:
dr.iloc[4]

nombre        Marisa López Collado
edad                            46
sexo                             M
peso                          51.0
altura                        1.58
colesterol                   148.0
Name: 4, dtype: object

In [80]:
dr.describe()

            edad        peso     altura  colesterol
count  14.000000   13.000000  14.000000   13.000000
mean   38.214286   70.923077   1.768571  220.230769
std    15.621379   16.126901   0.115016   39.847948
min    18.000000   51.000000   1.580000  148.000000
25%    24.750000   61.000000   1.705000  194.000000
50%    35.000000   65.000000   1.755000  210.000000
75%    49.750000   78.000000   1.840000  249.000000
max    68.000000  109.000000   1.980000  280.000000

In [81]:
dr.groupby(['sexo']).groups

{'H': [0, 2, 5, 6, 8, 9, 11, 12], 'M': [1, 3, 4, 7, 10, 13]}

In [82]:
pd.DataFrame(dr.groupby('sexo')['altura'])

   0                                                  1
0  H  0     1.79
2     1.81
5     1.74
6     1.72
8 ...
1  M  1     1.73
3     1.70
4     1.58
7     1.66
10...

In [85]:
#exportar
#dr.to_csv(r'C:\Users\Luca\Desktop\VsCode\Data Scientist\CURSADO HENRY DTS09\MOODULO 1\homework 4 pandas')